espressif/esp-rainmaker-common/test_app/sdkconfig.ci.linux
# Linux target specific settings
CONFIG_IDF_TARGET="linux"
CONFIG_COMPILER_OPTIMIZATION_DEFAULT=y

# Unity test framework configuration
CONFIG_UNITY_ENABLE_FLOAT=y
CONFIG_UNITY_ENABLE_DOUBLE=y
CONFIG_UNITY_ENABLE_COLOR=y
CONFIG_UNITY_ENABLE_IDF_TEST_RUNNER=y
CONFIG_UNITY_ENABLE_FIXTURE=y

# Mock implementations for Linux
CONFIG_ESP_RAINMAKER_MOCK_MQTT=y
CONFIG_ESP_RAINMAKER_MOCK_NETWORK=y
CONFIG_ESP_RAINMAKER_MOCK_NVS=y
